app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE ("pages"."order_index" IS NOT NULL) ORDER BY order_index ASC
---
  def get_ordered_page_info
    ordered_pages = Page.where(Page.arel_table[:order_index].not_eq(nil)).order("order_index ASC")

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "get_info"]]
---
  def get_page
    @page = Page.find(params[:id])